{
  "projectsArray": [
    {
      "title": "PROJECT: BSZ",
      "background": "project.png",
      "demoLink": "https://bsz-portfolio.herokuapp.com/",
      "githubLink": "https://github.com/benszucs/bsz-portfolio",
      "tech": [
        "HTML",
        "CSS",
        "Sass",
        "React",
        "Heroku"
      ],
      "userStories": [
        "The user can hover on a tile to look at the project in more detail/launch a demo of the project/open the code on GitHub",
        "In the 'projects' view, the user can navigate between all the projects using the arrows",
        "The user can navigate to the about page",
        "The user can navigate to the contact page and send an email using the form",
        "The user can follow links to the author's GitHub/LinkedIn/CV"
      ],
      "description": [
        "I designed and developed this fully responsive webapp in React, utilising various npm libraries like React-Router, React-Breakpoints to achieve this layout. The contact form uses EmailJS to handle outgoing emails, so no back-end was needed for this project.",
        "I wanted to make a webapp where I could showcase my personal projects that I have been working on, without the hassle of manually making new pages on a static website.",
        "Naturally React's reusable components were a perfect fit. I can just add the details of new projects to the data.json file and the app will render the new projects, already styled and functional.",
        "To host the site on Heroku I used a create-react-app buildpack."
      ]
    },
    {
      "title": "TO-DO APP",
      "background": "todo.png",
      "demoLink": "https://to-do-bisz.herokuapp.com/",
      "githubLink": "https://github.com/benszucs/to-do-app",
      "tech": [
        "HTML",
        "CSS",
        "Sass",
        "React.js",
        "Express",
        "Webpack",
        "Heroku"
      ],
      "userStories": [
        "The user can add to-do item",
        "The user can filter the list of to-dos",
        "The user can tick off to-to item, to mark it as completed (cross-out)",
        "The user can remove to-do item",
        "The user can clear the list",
        "The user can reset the original state"
      ],
      "description": [
        "After finishing the React track of Andrew Mead's Udemy course I put the newly learnt concept to the test by building this to-do app.",
        "The main objective of this project was to practice building things like filtering and CRUD functionality in React.",
        "Didn't use create-react-app for this project, the app is bundled together using Webpack and is hosted on Heroku, for which I built a simple server using Node.js"
      ],
      "otherLinks": [
        ["Udemy", "https://www.udemy.com/react-2nd-edition/"]
      ]
    },
    {
      "title": "QUOTE-GEN",
      "background": "quote.png",
      "demoLink": "https://bsz-quote-generator.herokuapp.com/",
      "githubLink": "https://github.com/benszucs/quote-generator",
      "tech": [
        "HTML",
        "CSS",
        "React.js",
        "Heroku"
      ],
      "userStories": [
        "The user can generate quotes from API (quote, author)",
        "The user can share quotes on Twitter"
      ],
      "description": [
        "Following the Quote generator brief on FreeCodeCamp.org I built this simple Random Quote Generator in React that uses a quote API to fetch data."
      ],
      "otherLinks": [
        ["Brief", "https://learn.freecodecamp.org/front-end-libraries/front-end-libraries-projects/build-a-random-quote-machine"],
        ["API", "https://talaikis.com/random_quotes_api/"]
      ]
    },
    {
      "title": "MOVIE-APP",
      "background": "movie.png",
      "demoLink": "https://bsz-movie.herokuapp.com/",
      "githubLink": "https://github.com/benszucs/movie-react",
      "tech": [
        "HTML",
        "CSS",
        "Bootstrap",
        "React.js",
        "Heroku"
      ],
      "userStories": [
        "The user can search for movies by entering year",
        "The user can navigate through the top 10 movies in a given year"
      ],
      "description": [
        "One of the first standalone applications I built to familiarise myself with the basics of React and also learn how to use APIs to get and display data.",
        "The app very simply renders movies for a given year by accessing the TMDB API. The year is selected by the user."
      ],
      "otherLinks": [
        ["API", "https://www.themoviedb.org/documentation/api"]
      ]
    }
  ]
}
